tutorials/suspensionFoam/RAS/duneTransport/initSimpleFoam/profilesInlet/0_org/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1e-9;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    top
    {
        type            nutkWallFunction;
        value           $internalField;
    }
    bed
    {
        type            nutkRoughWallFunction;
        Ks              uniform 0.1;
        Cs              uniform 0.5;
        value           $internalField;
    }
    sides
    {
        type            empty;
    }
}


// ************************************************************************* //
