tutorials/suspensionFoam/RAS/duneTransport/initSimpleFoam/profilesInlet/0_org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            fixedJump;
        patchType       cyclic;
        jump            uniform -0.4e-4;
        value           $internalField;
    }
    outlet
    {
        type            fixedJump;
        patchType       cyclic;
        value           $internalField;
    }
    top
    {
        type            fixedFluxPressure;
	gradient	$internalField;
    }
    bed
    {
	type 		fixedFluxPressure;
	gradient	$internalField;
    }
    sides
    {
        type            empty;
    }
}


// ************************************************************************* //
