tutorials/suspensionFoam/RAS/duneTransport/initSimpleFoam/profilesInlet/Allrun
#!/bin/sh

# Create mesh
blockMesh
#makeFaMesh

# create the intial time folder
cp -r 0_org 0

# Run suspensionFoam
suspensionFoam > log

suspensionFoam -postProcess -func R -time 0:
