tutorials/suspensionFoam/RAS/duneTransport/initSimpleFoam/profilesInlet/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  RAS;

RAS
{
   //RASModel        kOmega;
    RASModel        kOmegaSST;
    turbulence      on;
    printCoeffs     on;
    kOmegaSSTCoeffs
    {
        alphaK1         0.85;
        alphaK2         1;
        alphaOmega1     0.5;
        alphaOmega2     0.856;
        gamma1          0.555556;
        gamma2          0.44;
        beta1           0.075;
        beta2           0.0828;
        betaStar        0.09;
        a1              0.31;
        b1              1;
        c1              10;
        F3              false;
        decayControl    false;
        kInf            0;
        omegaInf        0;
    }

}

// ************************************************************************* //
