tutorials/suspensionFoam/RAS/duneTransport/initSimpleFoam/profilesInlet/system/surfaces
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

surfaces
{
    type            surfaces;
    libs            (sampling);
    writeControl    writeTime;

    surfaceFormat   raw;
    fields          (p U k omega);

    // interpolationScheme cellPoint;  //<- default

    surfaces
    {
        zNormal
        {
            type        cuttingPlane;
            point       (0.0005 0 0);
            normal      (1 0 0);
            interpolate true;
        }
    }
}


// ************************************************************************* //
